writeups/htb/challenges/pwn/pwn_questionnaire/questionnaire.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-05-10 Sat 01:30 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Questionnaire</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="/style.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">Questionnaire</h1>
<p class="spacing-64" \>

<p class="spacing-64" \>


<p>
Honestly, this is more a tutorial than a challenge. It's supposed to teach
something about binaries and binary exploitation. Start the instance, connect
through <code>telnet</code> or <code>netcat</code>, and just answer the questions:
</p>

<ol class="org-ol">
<li>The information is in the output before the question;</li>
<li>Same as above;</li>
<li>Same as above;</li>
<li>Same as above;</li>
<li>The information is in the new output before the question;</li>
<li>Same as above;</li>
<li>Same as above;</li>
<li>The information is in the <code>test.c</code> file from the challenge, or the code output.</li>
<li>This is a test you can do using the binary from the downloaded files. Recommended! Your answer is dependent on the length of your input.</li>
<li>Use a tool like <code>objdump</code> to get the answer.</li>
</ol>

<p>
After all these questions, you'll get the flag, and, hopefully, learned
something about binary exploitation!
</p>
<hr>
<footer>
  <div class="container">
    <ul class="menu-list">
      <li class="menu-list-item flex-basis-100-margin fit-content">
        <a href="/index.html">Home</a>
      </li>
      <li class="menu-list-item flex-basis-100-margin fit-content">
        <a href="/articles/articles.html">Articles</a>
      </li>
      <li class="menu-list-item flex-basis-100-margin fit-content">
        <a href="/writeups/writeups.html">Write-Ups</a>
      </li>
      <li class="menu-list-item flex-basis-100-margin fit-content">
        <a class="inactive-link">13-01-2021</a>
      </li>
    </ul>
  </div>
</footer>
</div>
</body>
</html>
